Revit 2026 API

# KeynoteEntries Properties

---

The KeynoteEntries type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from KeyBasedTreeEntries) |

#### Reference

KeynoteEntries Class

Autodesk.Revit.DB Namespace